class MyText {
  List<List<String>> registerText = [
    [
      "التسجيل/الحضور",
      """
يلتزم الطالب بتسجيل بياناته الصحيحة دون نقصان او خطأ -
يلتزم الطالب بالقواعد الموضوعة من خلال الأستاذ حتي يتسني له التكملة معنا و الحضور -
عدم الغياب اكثر من محاضرة حتي لا يتعرض الطالب للحظر """,
    ],
    [
      "المحاضرات / الباقات",
      """
  يلتزم كل طالب بعدم تصوير او تسريب المحاضرات المصورة علي المنصة -
  يلتزم الطالب باحترام الاستاذ و عدم استخدام المادة العملية استخدام سئ - 
  يلتزم الطالب بعدم التغيير في محتوي المنصة تحت اي ظرف كان""",
    ],
    [
      "الاكواد و المحفظة",
      """
يلتزم الطالب بعدم وجود اكواد قائمة من احتياجه معه لانة لا يوجد مرتحع لاكواد -
يلتزم الطالب بعدم شحن المحفظة بمبالغ كبيرة لانة لا يوجد استرداد للمحفظة -

""",
    ],
    [
      "شروط عامه",
      """
 يلتزم كل طالب بعدم تصوير او تسريب المحاضرات المصورة علي المنصة -
  يلتزم الطالب باحترام الاستاذ و عدم استخدام المادة العملية استخدام سئ - 
  يلتزم الطالب بعدم التغيير في محتوي المنصة تحت اي ظرف كان
""",
    ],
  ];

  List<String> gragdes = [
        "اختر الصف الدراسي",
        "الصف الثالث الثانوي",
        "الصف الثاني الثانوي",
        "الصف الاول الثانوي",
      ],
      division = ["اختار الشعبة", "عام", "علمي علوم", "علمي رياضة", "ادبي"],
      governorates = [
        "اختار المحافظة",
        "القاهرة",
        "الجيزة",
        "الإسكندرية",
        "الدقهلية",
        "البحر الأحمر",
        "البحيرة",
        "الفيوم",
        "الغربية",
        "الإسماعيلية",
        "المنوفية",
        "المنيا",
        "القليوبية",
        "الوادي الجديد",
        "السويس",
        "أسوان",
        "أسيوط",
        "بني سويف",
        "بورسعيد",
        "دمياط",
        "الشرقية",
        "جنوب سيناء",
        "كفر الشيخ",
        "مطروح",
        "الأقصر",
        "قنا",
        "شمال سيناء",
        "سوهاج"
      ],
      gender = ["ذكر", "انثي"],
      years = [
        "اختار السنه",
        "2022",
        "2021",
        "2020",
        "2019",
        "2018",
        "2017",
        "2016",
        "2015",
        "2014",
        "2013",
        "2012",
        "2011",
        "2010",
        "2009",
        "2008",
        "2007",
        "2006",
        "2005",
      ],
      months = [
        "اختار الشهر",
        "يناير",
        "فبراير",
        "مارس",
        "ابريل",
        "مايو",
        "يونيو",
        "يوليو",
        "اغسطس",
        "سبتمبر",
        "اكتوبر",
        "نوفمبر",
        "ديسمبر",
      ];

  Map<String, List<String>> governorateAreas = {
    "اختار المحافظة": [''],
    "القاهرة": [
      "المعادي",
      "مدينة نصر",
      "الزمالك",
      "الرحاب",
      "التجمع الخامس",
      "مصر الجديدة",
      "شبرا",
      "عين شمس"
    ],
    "الجيزة": [
      "الدقي",
      "المهندسين",
      "العجوزة",
      "الهرم",
      "6 أكتوبر",
      "الشيخ زايد",
      "بولاق الدكرور"
    ],
    "الإسكندرية": [
      "سموحة",
      "ميامي",
      "العصافرة",
      "المنشية",
      "بحري",
      "محرم بك",
      "العجمي"
    ],
    "الدقهلية": ["المنصورة", "ميت غمر", "طلخا", "المنزلة", "بلقاس", "نبروه"],
    "البحر الأحمر": ["الغردقة", "رأس غارب", "القصير", "مرسى علم", "سفاجا"],
    "البحيرة": ["دمنهور", "كفر الدوار", "إدكو", "رشيد", "المحمودية"],
    "الفيوم": ["مدينة الفيوم", "سنورس", "إطسا", "طامية", "يوسف الصديق"],
    "الغربية": ["طنطا", "المحلة الكبرى", "كفر الزيات", "زفتى", "قطور"],
    "الإسماعيلية": [
      "مدينة الإسماعيلية",
      "التل الكبير",
      "فايد",
      "القنطرة شرق",
      "القنطرة غرب"
    ],
    "المنوفية": ["شبين الكوم", "منوف", "سرس الليان", "الباجور", "قويسنا"],
    "المنيا": ["المنيا", "ملوي", "سمالوط", "مطاي", "أبو قرقاص"],
    "القليوبية": ["بنها", "شبرا الخيمة", "قليوب", "طوخ", "قها", "الخانكة"],
    "الوادي الجديد": ["الخارجة", "الداخلة", "باريس", "الفرافرة", "بلاط"],
    "السويس": ["مدينة السويس", "عتاقة", "الجناين", "فيصل"],
    "أسوان": ["مدينة أسوان", "كوم أمبو", "إدفو", "دراو", "أبو سمبل"],
    "أسيوط": ["مدينة أسيوط", "ديروط", "منفلوط", "أبنوب", "القوصية"],
    "بني سويف": ["مدينة بني سويف", "الفشن", "إهناسيا", "سمسطا", "الواسطى"],
    "بورسعيد": [
      "مدينة بورسعيد",
      "بورفؤاد",
      "حي الشرق",
      "حي العرب",
      "حي المناخ"
    ],
    "دمياط": ["مدينة دمياط", "رأس البر", "فارسكور", "كفر البطيخ", "الزرقا"],
    "الشرقية": [
      "الزقازيق",
      "العاشر من رمضان",
      "بلبيس",
      "أبو حماد",
      "منيا القمح"
    ],
    "جنوب سيناء": ["شرم الشيخ", "دهب", "نويبع", "رأس سدر", "طور سيناء"],
    "كفر الشيخ": ["مدينة كفر الشيخ", "دسوق", "بلطيم", "بيلا", "الحامول"],
    "مطروح": ["مرسى مطروح", "الضبعة", "العلمين", "سيدي براني", "سيوة"],
    "الأقصر": ["مدينة الأقصر", "إسنا", "أرمنت", "القرنة", "البياضية"],
    "قنا": ["مدينة قنا", "نجع حمادي", "دشنا", "قفط", "قوص"],
    "شمال سيناء": ["العريش", "الشيخ زويد", "رفح", "بئر العبد", "نخل"],
    "سوهاج": ["مدينة سوهاج", "جرجا", "طهطا", "أخميم", "البلينا"]
  };

  Map<String, List<String>>? monthDaysInArabic = {
    "شهر": ["اليوم"],
    "يناير": List.generate(31, (index) => '${index + 1}'),
    "فبراير": List.generate(28, (index) => '${index + 1}'),
    "مارس": List.generate(31, (index) => '${index + 1}'),
    "أبريل": List.generate(30, (index) => '${index + 1}'),
    "مايو": List.generate(31, (index) => '${index + 1}'),
    "يونيو": List.generate(30, (index) => '${index + 1}'),
    "يوليو": List.generate(31, (index) => '${index + 1}'),
    "أغسطس": List.generate(31, (index) => '${index + 1}'),
    "سبتمبر": List.generate(30, (index) => '${index + 1}'),
    "أكتوبر": List.generate(31, (index) => '${index + 1}'),
    "نوفمبر": List.generate(30, (index) => '${index + 1}'),
    "ديسمبر": List.generate(31, (index) => '${index + 1}'),
  };
}
